In [4]:
import pandas as pd
import numpy as np

nda = np.array([["Gleb", 17, 11, "Computer"], ["Leon", 11001, 'legend', "Unknown"]])
df = pd.DataFrame(nda, columns=['Name', 'Age', 'Class', 'Hobbie'])
df

   Name    Age   Class    Hobbie
0  Gleb     17      11  Computer
1  Leon  11001  legend   Unknown

In [10]:
df.drop(['Hobbie'], axis = 1)

   Name    Age   Class
0  Gleb     17      11
1  Leon  11001  legend